# Q1

In [171]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality','Overall']
q1 = pd.DataFrame(lst,columns=col, index=[1,2,3])
q1

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [172]:
q2 = pd.DataFrame(lst,columns=col, index = [i for i in range(1,4)])
q2

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [173]:
array1  = [[94, 89, 63],[93, 92, 48],[92, 94, 56]]
array2 = np.array(array1)
array2[:1,1:]

array([[89, 63]])

In [174]:
import pandas as pd, numpy as np, seaborn as sns, matplotlib.pyplot as plt, warnings
warnings.filterwarnings('ignore')
pd.set_option("display.max_columns", None)

In [175]:
df = pd.read_csv("./FoodBalanceSheets_E_Africa_NOFLAG.csv")

In [176]:
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [177]:
df.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

# Q4

In [178]:
df.shape

(60943, 12)

# Q5

In [179]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

# Q6

In [180]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

# Q7

In [181]:
y = [(2, 4), (7, 8), (1, 5, 9)]
y[1][-1]

8

In [182]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [183]:
df.isna().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

In [184]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Area Code,60943.0,134.265576,72.605709,4.0,74.0,136.00,195.00,276.0
Item Code,60943.0,2687.176706,146.055739,2501.0,2562.0,2630.00,2775.00,2961.0
Element Code,60943.0,3814.856456,2212.007033,511.0,684.0,5142.00,5511.00,5911.0
Y2014,59354.0,134.196282,1567.663696,-1796.0,0.0,0.09,8.34,176405.0
Y2015,59395.0,135.235966,1603.403984,-3161.0,0.0,0.08,8.46,181137.0
Y2016,59408.0,136.555222,1640.007194,-3225.0,0.0,0.08,8.43,185960.0
Y2017,59437.0,140.917765,1671.862359,-1582.0,0.0,0.10,9.00,190873.0
Y2018,59507.0,143.758381,1710.782658,-3396.0,0.0,0.07,9.00,195875.0

# Q14 Highest correlation Year with Element

In [185]:
df[['Element Code','Y2014','Y2015','Y2016','Y2017','Y2018']].corr()

              Element Code     Y2014     Y2015     Y2016     Y2017     Y2018
Element Code      1.000000  0.024457  0.023889  0.023444  0.024254  0.024279
Y2014             0.024457  1.000000  0.994647  0.996081  0.995230  0.994872
Y2015             0.023889  0.994647  1.000000  0.995739  0.988048  0.988208
Y2016             0.023444  0.996081  0.995739  1.000000  0.992785  0.992757
Y2017             0.024254  0.995230  0.988048  0.992785  1.000000  0.998103
Y2018             0.024279  0.994872  0.988208  0.992757  0.998103  1.000000

# Q13 Total number and percentage of missing data in 2016

In [186]:
missing_data = df["Y2016"].isna().sum()
total2016 = df["Y2016"].count()
percentage_missing_data = ((missing_data/total2016)*100)
print("The total number of missing data: {} \npercentage is {} %".format(missing_data,round(percentage_missing_data,2)))

The total number of missing data: 1535
percentage is 2.58 %

# Q12 Mean and Standard Deviation for 2015

In [187]:
round(df['Y2015'].describe(),3)

count     59395.000
mean        135.236
std        1603.404
min       -3161.000
25%           0.000
50%           0.080
75%           8.460
max      181137.000
Name: Y2015, dtype: float64

# Q11

In [205]:
fat = df[df["Item"] == 'Animal fats']
fat  = fat[["Item","Y2014","Y2017"]]
# fat = df[df["Item"] == 'Fats, Animals, Raw']
# fat
ouch = fat.groupby('Item').sum().reset_index()
ouch

          Item      Y2014      Y2017
0  Animal fats  209460.54  269617.53

# Q15 Highest Import Quantity by Year

In [189]:
df_year = df[df["Element"] == "Import Quantity"]
df_year = df_year[['Element','Y2014','Y2015','Y2016','Y2017','Y2018']]
df_year.groupby('Element').sum()

                     Y2014      Y2015      Y2016      Y2017      Y2018
Element
Import Quantity  274144.48  267018.46  286582.78  294559.09  287997.09

# Q16 Total Number of sum of Production in 2014

In [190]:
year = df[df["Element"] == "Production"]
year = year[['Element','Y2014']]
year.groupby('Element').sum().reset_index()

      Element       Y2014
0  Production  1931287.75

# Q17&18 Highest and 3rd lowest sum of Element in 2018

In [191]:
y2018 = df[['Element','Y2018']]
y2018.groupby('Element').sum().sort_values(by=['Y2018'],ascending=False).reset_index()

                                   Element       Y2018
0                 Domestic supply quantity  2161192.10
1                               Production  2075072.89
2                                     Food  1303841.28
3            Total Population - Both sexes  1140605.00
4            Food supply (kcal/capita/day)   455261.00
5                               Processing   308429.00
6                          Import Quantity   287997.09
7                                     Feed   233489.68
8                          Export Quantity   181594.80
9                                   Losses   163902.00
10                   Other uses (non-food)    91300.97
11     Food supply quantity (kg/capita/yr)    49056.85
12                               Residuals    34864.00
13                                    Seed    25263.14
14                         Stock Variation    20577.91
15  Protein supply quantity (g/capita/day)    11833.56
16      Fat supply quantity (g/capita/day)    10258.69
17                     Tourist consumption       90.00

# Q19 Total Import Quantity in Algeria in 2018

In [192]:
country = df[df["Area"] == "Algeria"]
element = country[country["Element"] == "Import Quantity" ]
element = element[["Area","Y2018"]]
element.groupby("Area").sum().reset_index()

      Area     Y2018
0  Algeria  36238.29

# Q20 Total number of unique countries

In [193]:
pd.DataFrame(df["Area"].unique()).count()

0    49
dtype: int64